# Number Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSpace..::..Number Property
EnergyAnalysisSpace Class See Also
---
The number to identify the space.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string Number { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Number As String
	Get
```

Visual C++
---
```text
public:
property String^ Number {
	String^ get ();
}
```

# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace